import { createSlice } from "@reduxjs/toolkit";
import { IMAGES } from "../../constants/image";


const challengeSlice = createSlice({
    initialState: {
        data: [
            {
                name: 'مسعود طباطبایی',
                desc: 'مدیرعامل دیجی کالا',
                img: IMAGES.MASOUD,
                story: 'چالش',
                id: '1',
                challenges: [
                    {
                        name: 'جعبه‌های لبخند',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/MT.mp4',
                        desc: `
                        کارتن های دیجی کالا ، برای هر کدوم از ما یکی از اولین چیزهایی که باشنیدن اسم دیجی کالا به یادش میفتیم،
                        بسته بندی که با همه خاطره هایی که برامون ساخته امروز تبدیل به یکی از چالش های ما شده و ذهن  مدیرعامل دیجی کالا رو به خودش مشغول کرده.  این بسته بندی ها سالانه هزینه خیلی زیادی  برامون داره و متاسفانه بعد از رسیدن به دست مشتری معمولا دور ریخته میشه.
                        مسعود طباطبایی از ما دعوت کرده تا چالش بسته بندی محصولات رو حل کنیم:
                        بسته بندی محصولاتمون رو چه جوری انجام بدیم که کم هزینه و متنوع تر از بسته بندی فعلی باشه و برای مشتری هامون کاربرد بیشتری داشته و جلوی این همه دور ریز و آسیب به محیط زیست رو بگیره؟
                        این موشک با ایده های تو حرکت میکنه
                        آماده ای؟
                        `,
                        id: '1-1'
                    },
                ],
            },
            {
                name: 'حمید محمدی',
                desc: 'رئیس هیت مدیره گروه دیجی کالا',
                img: IMAGES.HAMID,
                story: 'چالش',
                id: '2',
                challenges: [
                    {
                        name: 'فروشندگان، بازوهای کلیدی',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/HM1.mp4',
                        desc: `
                            فروش محصول در دیجی کالا در کنار مزایایی که برای فروشندگان  داره، محدودیت هایی هم داره که باعث می شه  فروشندگان ترجیح بدن از سایر کانال های فروش مثل اینستاگرام و ... برای ارائه محصول خود حتی به قیمت کمتر استفاده کنن.  
                            محدودیت هایی  مثل کمسیون سهم دیجی کالا، قوانین مربوط به دیجی کالا، مالیات، مرجوعی کالا و ...
                            در واقعیت درصد کالاهای مرجوعی نسبت به تصور فروشندگان بسیار کمتره و خیلی از این ریسک های ادراک شده با واقعیت فاصله داره.
                            حمید محمدی رئیس هیئت مدیره گروه دیجی کالا دنبال ایده های خلاقانه ای که این ریسک ادراک شده توسط فروشندگان رو کاهش بده و اون ها رو ترغیب کنه تا محصولات خودشون رو در پلتفورم دیجی کالا به فروش برسونن.
                        `,
                        id: '2-1'
                    },
                    {
                        name: 'دیجی‌کالا، از پلتفورم تا سوشال مدیا',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/HM2.mp4',
                        desc: `
                            با توجه به تمایل افراد برای به اشتراک گذاری تجربه خرید خود در فضای های سوشال( مانند اینستاگرام) و از طرف دیگه تاثیر نظرات و امتیازات کاربران  در پروسه خرید از دیجی کالا، ایجاد امکانی برای ساخت پروفایل در پلتفرم دیجی کالا برای کاربران به منظور دنبال کردن تجربه خرید شبکه دوستان و اطرافیانشون می تونه به ما در افزایش اینگیجمت با پلتفرم و در نتیجه افزایش فروش کمک کنه. در صورتی که فرض کنیم  پلتفورم دیجی‌کالا به سمت سوشال مدیا شدن پیش خواهد رفت و این امکانات به پلتفرم اضافه بشه، حمید محمدی به دنبال ایده هایی که  کاربران  را  به ساختن پروفایل و اشتراک تجربه ی خرید خود ترغیب می کنه. 
                        `,
                        id: '2-2'
                    },
                ],
            },
            {
                name: 'سعید محمدی',
                desc: 'مدیرعامل گروه دیجی کالا',
                img: IMAGES.SAEED,
                story: 'چالش',
                id: '3',
                challenges: [
                    {
                        name: 'ماجرای پوشاک',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/SM1.mp4',
                        desc: `
                            در پلتفرم های فروش آنلاین در دنیا حدود 20 تا 25 درصد از سهم فروش مربوط به کالاهای مد و پوشاکه اما در دیجی کالا این عدد حدود 7 الی  8 درصده.
                            ما توی این موضوع محدودیت هایی هم داریم مثل اینکه واردات پوشاک خارجی و فروش اون ها در کانال های رسمی مثل دیجی کالا ممنوعه یا اینکه در معرفی و ارائه محصولات پوشاک محدودیت هایی داریم.
                            با دونستن  همه ی این محدودیت های قانونی، سعید محمدی منتظر  ایده های خلاقانه ای که باعث بشه  سهم فروش کالاهای مد و پوشاک افزایش پیدا کنه.
                        `,
                        id: '3-1'
                    },
                    {
                        name: 'نوآوری در تجربه خرید آنلاین',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/SM2.mp4',
                        desc: `
                            خرید کردن همیشه برای ما یک تجربه ی لذت بخشه، خرید حضوری، قدم زدن بین قفسه های یک فروشگاه دیدن و لمس کالا ها این تجربه رو لذت بخش تر میکنه
                            حتما برای هممون پیش اومده که موقع قدم زدن و دیدن ویترین فروشگاه ها وسوسه بشیم و خریدهای بدون برنامه ریزی قبلی انجام بدیم.  سعید محمدی مشتاقه ایده های خلاقانه شما رو برای شبیه کردن تجربه خرید از دیجی کالا به خرید حضوری بشنوه.
                        `,
                        id: '3-2'
                    },
                    {
                        name: 'نبض استعدادها',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/SM3.mp4',
                        desc: `
                            ما در دیجی کالا با بیش از 800 عنوان شغلی متفاوت و یک جمعیت بیش از 8000 نفری، مجموعه  ای گسترده و متنوع از افراد با خصوصیات و استعداد های متفاوت داریم. کشف این استعداد ها و تلاش برای ایجاد بستری برای درخشش اون ها یکی از دغدغه های سعید محمدی مدیر عامل گروه دیجی کالاست و دوست داره ایده های شما رو راجب این چالش بشنوه.
                            به نظر شما چی کار باید بکنیم تا این استعداد ها در  نقاط کور و سایه هایی که باعث میشه بستر مناسبی برای بروز توانمندی هاشون نداشته باشن قرار نگیرن؟
                        `,
                        id: '3-3'
                    },
                ],
            },
            {
                name: 'کمال ریاضی',
                desc: 'معاون منابع انسانی',
                img: IMAGES.KAMAL,
                story: 'چالش',
                id: '4',
                challenges: [
                    {
                        name: 'یک هدیه برای همه',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/KR.mp4',
                        desc: `
                        ما توی دیجی‌کالا همکارای زیادی با تنوع گسترده‌ای داریم، از همکاران عملیاتی گرفته تا دفاتر مرکزی، همیشه طراحی هدایای مناسبتی که این تنوع رو پوشش بده و برای همه‌ی اون‌ها جذاب باشه کار سختیه، از طرفی مهمه که این هدایا تجربه ماندگاری توی ذهن آدم‌ها رقم بزنه. کمال ریاضی معاون منابع انسانی دیجی کالا از هممون دعوت کرده تا به این چالش فکر کنیم که چه جوری این پکیج هدیه رو طراحی کنیم تا تقاطع سلایق و علایق همه همکارانمون باشه؟
                        `,
                        id: '4-1'
                    },
                ],
            },
            {
                name: 'ندا برادران',
                desc: 'معاون محصول',
                img: IMAGES.NEDA,
                story: 'چالش',
                id: '5',
                challenges: [
                    {
                        name: 'هوش مصنوعی',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/NB1.mp4',
                        desc: `
                            این روزا کمتر کسی هست که در موردLLM ( Large Language Model) ها (مثل ChatGPT, Bard,  و ...)  خبری به گوشش نرسیده باشه.
                            این ترند، فرصت های شگفت انگیزی برای شرکت ها به وجود آورده و معلومه که موشک دیجی کالا نمیخواد از این فرصت ها جا بمونه، پس پروژه تحقیق و بررسی روی این موضوع شروع شده و تیم تحقیقات داره تلاش میکنه بفهمه این سوخت رو چه جوری تامین کنه تا این موشک با سرعت چند برابری حرکت کنه
                            ندا برادران ( CPO دیجی کالا)  از همه ی افراد علاقمند به این موضوع دعوت کرده تا توی این تحقیقات ایده های خودشون رو ارائه بدن.
                            به نظر شما LLM ها می تونن کدوم چالش های بزرگ دیجی کالا رو حل بکنن و سد جلوی کدوم فرصت هایی که به سراغشون نرفتیم یا امکان رفتن به سمتشون رو نداشتیم  رو بشکنن؟ 
                            برای ایده ی خودت یه پروپوزال آماده کن و آماده باش تا توی جلسه داوری نسخه MVP ایده خودت رو ارائه بدی
                            این موشک با ایده های تو حرکت میکنه پس دست بجنبون                        
                        `,
                        id: '5-1'
                    },
                    {
                        name: 'بهبود شاخص‌ها بدون افزایش هزینه‌ها',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/NB2.mp4',
                        desc: `
                            ندا برادران یه چالش جذاب داره که حدس می‌زنه آدمای باهوش و با انگیزه از پس حل کردنش بر میان.
                            همه‌ی ما دوست داریم موقعی که از دیجی‌کالا خرید می‌کنیم در زودترین زمان سفارشمون رو دریافت کنیم اما به علت هزینه‌های زیادی که عمده اون شامل هزینه‌های عملیاتی می‌شه در حال حاضر برامون سخته که این بازه زمانی رو کاهش بدیم.
                            ندا برادران دعوتمون کرده که به این چالش فکر کنیم وایده‌هامون رو بگیم: چه جوری می تونیم بدون اینکه هزینه به ازای هر سفارش (CPO:Cost per Order) رو افزایش بدیم، بازه زمانی که مشتری به عنوان اولین زمان تحویل مشاهده میکنه(OCT:Order Cycle Time)  رو  کاهش بدیم؟                        
                        `,
                        id: '5-2'
                    },
                ],
            },
            {
                name: 'حمیدرضا سلیمانی',
                desc: 'معاون تکنولوژی',
                img: IMAGES.HAMIDREZA,
                story: 'چالش',
                id: '6',
                challenges: [
                    {
                        name: 'حرکت بر لبه تکنولوژی',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/HS.mp4',
                        desc: `
                            حمیدرضا سلیمانی (CTO دیجی کالا )  در بخشی از  این موشک در حال تلاش برای رسیدن به یک ماموریت سخت و مهمه.
                            تبدیل دیجی کالا به شماره یک شرکت های تکنولوژی محور 
                            برای رسیدن به این ماموریت سخت 
                            از همه ما دعوت کرده تا همراهش باشیم و ایده های خودمون رو برای  رسوندن این موشک به مقصدش  بگیم.
                            شما فکر میکنید برای رسیدن به این ماموریت چه کارهایی باید انجام بدیم؟
                            این موشک با ایده های تو سریع تره، پس بزن بریم
                        `,
                        id: '6-1'
                    },
                ],
            },
            {
                name: 'علی علوی',
                desc: 'معاون بازاریابی',
                img: IMAGES.ALI_ALAVI,
                story: 'چالش',
                id: '7',
                challenges: [
                    {
                        name: 'کمپین تبلیغاتی',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/AA.mp4',
                        desc: `
                            با ورود تبلیغات دیجی کالا به تلویزیون، قشر مخاطب ما متنوع تر از قبل شده، ( از روستا نشینان شمال تا جنوب کشور گرفته تا شهر های کوچیک و بزرگ) ما برای تحت تاثیر قرار  دادن این قشر گسترده و جدید نیاز به ایده های 
                            خلاقانه در طراحی کمپین هامون داریم، علی علوی( CMO  دیجی کالا) 
                            منتظره تا ایده های خفن شما رو برای کمپین های تبلیغاتی تلویزیونی بشنوه. مهم نیست توی تیم مارکتینگ کار میکنین یا تجربه ی مارکتینگی داشته باشین، کافیه خودتون رو جای  هموطنامون توی نقاط مختلف کشور بذارین و به این فکر کنین که  چه کمپینی میتونه جرقه ی خرید از دیجی کالا رو تو ذهنتون بزنه؟ 
                            یادتون باشه بیننده باید به سختی بتونه بی تفاوت از ایده ی وسوسه کننده شما  رد بشه .
                            آماده سوخت رسانی به این موشک در حال حرکت هستی؟
                        `,
                        id: '7-1'
                    },
                ],
            },
            {
                name: 'علیشاد اعتضادی',
                desc: 'مدیر عامل دیجی اکسپرس',
                img: IMAGES.ALISHAD,
                story: 'چالش',
                id: '8',
                challenges: [
                    {
                        name: 'دیجی‌اکسپرس',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/AE2.mp4',
                        desc: `
                            شرکت دیجی اکسپرس یکی از شرکت های زیرمجموعه گروه دیجی کالا و یکی از بال های اصلی این موشک در حال حرکته. اما زمانش رسیده تا این بازوی قوی برای پیش گرفتن مسیر خودش تلاش کنه تا به صورت مستقل خدمات خودش رو که شامل ارسال بسته ها و کالاها شرکت های مختلف میشه رو به مشتریان جدید ارائه بده. اما همونطور که هممون میدونیم  ورود قدرتمند به بازار  و ایجاد آگاهی از برند علاوه بر نیاز به ایده های خلاقانه میتونه هزینه های مارکتینگی سنگینی داشته باشه. علیشاد اعتضادی  مدیرعامل دیجی اکسپرس چالش خودش رو در ایده مون به همه ی ما به اشتراک گذاشته و دنبال ایده های خلاقانه ای برای برندینگ دیجی اکسپرس با کمترین هزینه ها می گرده
                        `,
                        id: '8-1'
                    },
                ],
            },
            {
                name: 'حامد پورحاجی',
                desc: 'مدیرکل، ریسک، حسابرسی و انطباق',
                img: IMAGES.HAMED,
                story: 'چالش',
                id: '9',
                challenges: [
                    {
                        name: 'شناسایی هوشمند ریسک ها',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/HP.mp4',
                        desc: `
                            واحد ریسک، حسابرسی و انطباق همیشه تلاش میکنه تا مراقب عواملی که می تونه عملکرد موشک دیجی کالا رو مختل کنه و جلوی اوج گرفتن اونو بگیره شناسایی کنه و به موقع از اون هاپیشگیری کنه.
                            هوش مصنوعی می تونه فرصت های ویژه ای برای شناسایی به موقع و سریع  این ریسک ها و تخلفات ایجاد کنه. 
                            حامد پورحاجی مدیر کل واحد RAC  از همه ی ما دعوت کرده تو توی این چالش شرکت کنیم:
                            به نظر شما برای چه نوع تخلفات و ریسک هایی و به چه نحوی می تونیم از هوش مصنوعی استفاده کنیم؟
                        `,
                        id: '9-1'
                    },
                ],
            },
            {
                name: 'وحیدرضا سلیمانی',
                desc: 'مدیرکل توسعه کسب و کار',
                img: IMAGES.VAHIDREZA,
                story: 'چالش',
                id: '10',
                challenges: [
                    {
                        name: 'زمین بازی بزرگتر',
                        id: '10-1',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/VS.mp4',
                        desc: `
                            سهم خرید حوزه FMCG در ایران نسبت به سایر کشور به صورت چشمگیری پایینه. ایده ها این‌بار باید به کمک وحید رضا سلیمانی بیان تا مسیری بسازن برای افرایش سهم خرید به صورت آنلاین در سبد خرید مشتریان. به نظر شما با چه ایده‌های می‌تونیم جامعه ایرانی رو ترغیب کنیم تا خرید های مثل خرید های روزانه‎‌ی خودش رو بیشتر به صورت آنلاین انجام بده؟
                        `,
                    },
                ],
            },
            {
                name: 'مهران محمدی',
                desc: 'مدیر ارشد تجربه مشتریان',
                img: IMAGES.MEHRAN_MOHAMMADI,
                story: 'چالش',
                id: '11',
                challenges: [
                    {
                        name: 'دغدغه‌ی اصلی مشتریان',
                        referee: [
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            },
                            {
                                name: 'فرزاد دادخواه',
                                desc: 'مدیر عامل دیجی جت',
                                img: IMAGES.MASOUD,
                            }
                        ],
                        videoUrl: 'https://dhr.digikala.com/api/v1/stream/MM.mp4',
                        desc: `
                            وقتی  دلایل نارضایتی مشتریان دیجی کالا در سال های گذشته  رو مرور می کنیم، مهم ترین چالشی که همیشه باهاش روبرو بودیم مسئله کیفیت کالاهای دریافتی بوده،
                            ممکنه برای خود ما هم پیش اومده باشه که کالایی که از دیجی کالا سفارش دادیم آسیب دیده باشه یا با سفارش ما مغایرت داشته باشه. مهران محمدی با توجه به ماموریتی که در تیم تجربه مشتریان داره  دوست داره ایده های ما رو برای حل این چالش بشنوه. اما برای حل این چالش یه سری محدودیت ها وجود داره:
                            با توجه به تنوع چند میلیونی کالا ها در دیجی کالا  و پردازش صدها هزار کالا در روز امکان بررسی ریز به ریز همه این کالا ها وجود نداره  و از طرفی خیلی از این  کالا ها از طرف فروشنده ها در پکیج به فروش می رسن  و اگر باز بشن تبدیل به کالای دست دوم میشن
                            با دونستن همه ی این محدودیت ها ، به نظر شما ما چطور میتونیم به مشتریان دیجی کالا این اطمینان رو بدیم که از دیجی کالا، کالای فیک، مغایر، آسیب دیده و کم کیفیت دریافت نمی کنند؟                        
                        `,
                        id: '11-1'
                    },
                ],
            },
        ]
    },
    name: 'challenge',
    reducers: {
        SET_VIDEO: (state, action) => {
            state.data[ action.payload.id ].challenges[ action.payload.id2 ].videoUrl = action.payload.videoUrl;
        }
    }
})

export default challengeSlice.reducer;